{
    "blogs": [
        {
            "title": "Git & GitHub: An Invitation to Version Control",
            "abstract": "This blogpost is a slightly expanded conversion of a talk, I gave to the students of CS460/CS660 at NISER, Bhubaneswar, on January 12, 2024. It is a tutorial-style introduction to Git & GitHub, and how to use them for version control. This blogpost / talk is meant for beginners, and assumes no prior knowledge of Git or GitHub. It is also meant to be interactive, so that the readers can follow along and try out the git commands themselves.",
            "link": "https://sdgniser.github.io/coding_club_blogs/blogs/2024/01/12/git-and-github.html",
            "date": "Jan 12, 2024",
            "author": "Jyotirmaya Shivottam"
        },
        {
            "title": "Remote Devlopment on SSH Servers",
            "abstract": "Secure Shell servers, are used for providing secure and encrypted access to remote servers. Here we dive into the details of these servers, covering topics like creating servers, setting up environments, updating projects, and running code.",
            "link": "https://sdgniser.github.io/coding_club_blogs/blogs/2024/01/06/ssh-servers.html",
            "date": "Jan 6, 2024",
            "author": "Sagar Prakash Barad"
        },
        {
            "title": "Markdown",
            "abstract": "Here we focus on the fundamentals of Git & GitHub, covering basic concepts like commits, branches, pull requests (PRs), merges, and integration with other tools used by coders, such as VS Code.",
            "link": "https://sdgniser.github.io/coding_club_blogs/blogs/2023/12/29/markdown.html",
            "date": "Dec 29, 2023",
            "author": "Aritra Mukhopadhyay"
        },
        {
            "title": "Why Neural Network",
            "abstract": "We want to build an intelligent system. But why neural networks? In this, we will explore the concept of universal approximation, which states that neural networks can theoretically approximate any function, given enough hidden units and a suitable activation function.",
            "link": "https://sdgniser.github.io/coding_club_blogs/blogs/2024/03/24/linear-regression-and-gradient-descent.html",
            "date": "Nov 25, 2023",
            "author": "Shriman Keshri"
        },
        {
            "title": "Hello, world.",
            "abstract": "The Software Development Group at NISER has been operational since the fall of 2018, with the aim of bringing together people from different disciplines who prefer a code first approach to solving problems.",
            "link": "Pages/HelloWorld.html",
            "date": "May 1, 2019",
            "author": "Ayush Singh"
        }
    ]
}
